{
  "_name_or_path": "OrionStarAI/Orion-14B-Chat-RAG",
  "architectures": [
    "OrionForCausalLM"
  ],
  "attention_bias": false,
  "auto_map": {
    "AutoConfig": "OrionStarAI/Orion-14B-Chat-RAG--configuration_orion.OrionConfig",
    "AutoModelForCausalLM": "OrionStarAI/Orion-14B-Chat-RAG--modeling_orion.OrionForCausalLM"
  },
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 5120,
  "initializer_range": 0.02,
  "intermediate_size": 15360,
  "max_position_embeddings": 4096,
  "max_sequence_length": 4096,
  "model_type": "orion",
  "num_attention_heads": 40,
  "num_hidden_layers": 40,
  "num_key_value_heads": 40,
  "pad_token_id": 0,
  "pretraining_tp": 1,
  "quantization_config": {
    "bnb_4bit_compute_dtype": "bfloat16",
    "bnb_4bit_quant_type": "nf4",
    "bnb_4bit_use_double_quant": true,
    "llm_int8_enable_fp32_cpu_offload": false,
    "llm_int8_has_fp16_weight": false,
    "llm_int8_skip_modules": null,
    "llm_int8_threshold": 6.0,
    "load_in_4bit": true,
    "load_in_8bit": false,
    "quant_method": "bitsandbytes"
  },
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.37.2",
  "use_cache": true,
  "vocab_size": 84608
}
